*** payjoin/src/send/mod.rs:115:28: replace + with - in PsbtContext::check_fees

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace + with - in PsbtContext::check_fees
@@ -107,17 +107,17 @@
                     .map_err(InternalProposalError::PrevTxOut)?
                     .script_pubkey;
                 if original_spks.contains(spk) {
                     Ok(acc)
                 } else {
                     let weight = input_pair
                         .expected_input_weight()
                         .map_err(InternalProposalError::InputWeight)?;
-                    Ok(acc + weight)
+                    Ok(acc - /* ~ changed by cargo-mutants ~ */ weight)
                 }
             },
         )?;
         ensure!(
             contributed_fee <= original_fee_rate * additional_input_weight,
             FeeContributionPaysOutputSizeIncrease
         );
         if self.min_fee_rate > FeeRate::ZERO {

---- send::test::official_vectors stdout ----
original: Psbt {
    unsigned_tx: Transaction {
        version: Version(
            2,
        ),
        lock_time: 211 blocks,
        input: [
            TxIn {
                previous_output: OutPoint {
                    txid: 833b085de288cda6ff614c6e8655f61e7ae4f84604a2751998dc25a0d1ba278f,
                    vout: 0,
                },
                script_sig: Script(),

failures:
    send::test::official_vectors

test result: FAILED. 33 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
