*** payjoin/src/send/mod.rs:154:54: replace == with != in PsbtContext::check_inputs

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace == with != in PsbtContext::check_inputs
@@ -146,17 +146,17 @@
         let mut original_inputs = self.original_psbt.input_pairs().peekable();
 
         for proposed in proposal.input_pairs() {
             ensure!(proposed.psbtin.bip32_derivation.is_empty(), TxInContainsKeyPaths);
             ensure!(proposed.psbtin.partial_sigs.is_empty(), ContainsPartialSigs);
             match original_inputs.peek() {
                 // our (sender)
                 Some(original)
-                    if proposed.txin.previous_output == original.txin.previous_output =>
+                    if proposed.txin.previous_output != /* ~ changed by cargo-mutants ~ */ original.txin.previous_output =>
                 {
                     check_eq!(
                         proposed.txin.sequence,
                         original.txin.sequence,
                         SenderTxinSequenceChanged
                     );
                     ensure!(
                         proposed.psbtin.final_script_sig.is_none(),

---- send::test::official_vectors stdout ----
original: Psbt {
    unsigned_tx: Transaction {
        version: Version(
            2,
        ),
        lock_time: 211 blocks,
        input: [
            TxIn {
                previous_output: OutPoint {
                    txid: 833b085de288cda6ff614c6e8655f61e7ae4f84604a2751998dc25a0d1ba278f,
                    vout: 0,
                },
                script_sig: Script(),

failures:
    send::test::official_vectors

test result: FAILED. 33 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
