*** payjoin/src/send/mod.rs:208:50: replace == with != in PsbtContext::restore_original_utxos

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace == with != in PsbtContext::restore_original_utxos
@@ -200,17 +200,17 @@
     /// require it to be present to sign.
     fn restore_original_utxos(&self, proposal: &mut Psbt) -> InternalResult<()> {
         let mut original_inputs = self.original_psbt.input_pairs().peekable();
         let proposal_inputs =
             proposal.unsigned_tx.input.iter().zip(&mut proposal.inputs).peekable();
 
         for (proposed_txin, proposed_psbtin) in proposal_inputs {
             if let Some(original) = original_inputs.peek() {
-                if proposed_txin.previous_output == original.txin.previous_output {
+                if proposed_txin.previous_output != /* ~ changed by cargo-mutants ~ */ original.txin.previous_output {
                     proposed_psbtin.non_witness_utxo = original.psbtin.non_witness_utxo.clone();
                     proposed_psbtin.witness_utxo = original.psbtin.witness_utxo.clone();
                     proposed_psbtin.bip32_derivation = original.psbtin.bip32_derivation.clone();
                     proposed_psbtin.tap_internal_key = original.psbtin.tap_internal_key;
                     proposed_psbtin.tap_key_origins = original.psbtin.tap_key_origins.clone();
                     original_inputs.next();
                 }
             }

---- send::test::official_vectors stdout ----
original: Psbt {
    unsigned_tx: Transaction {
        version: Version(
            2,
        ),
        lock_time: 211 blocks,
        input: [
            TxIn {
                previous_output: OutPoint {
                    txid: 833b085de288cda6ff614c6e8655f61e7ae4f84604a2751998dc25a0d1ba278f,
                    vout: 0,
                },
                script_sig: Script(),

failures:
    send::test::official_vectors

test result: FAILED. 33 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
