*** payjoin/src/send/mod.rs:238:51: replace == with != in PsbtContext::check_outputs

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace == with != in PsbtContext::check_outputs
@@ -230,17 +230,17 @@
             match (original_outputs.peek(), self.fee_contribution) {
                 // fee output
                 (
                     Some((original_output_index, original_output)),
                     Some(AdditionalFeeContribution {
                         max_amount: max_fee_contrib,
                         vout: fee_contrib_idx,
                     }),
-                ) if proposed_txout.script_pubkey == original_output.script_pubkey
+                ) if proposed_txout.script_pubkey != /* ~ changed by cargo-mutants ~ */ original_output.script_pubkey
                     && *original_output_index == fee_contrib_idx =>
                 {
                     if proposed_txout.value < original_output.value {
                         contributed_fee = original_output.value - proposed_txout.value;
                         ensure!(contributed_fee <= max_fee_contrib, FeeContributionExceedsMaximum);
                         // The remaining fee checks are done in later in `check_fees`
                     }
                     original_outputs.next();

---- send::test::official_vectors stdout ----
original: Psbt {
    unsigned_tx: Transaction {
        version: Version(
            2,
        ),
        lock_time: 211 blocks,
        input: [
            TxIn {
                previous_output: OutPoint {
                    txid: 833b085de288cda6ff614c6e8655f61e7ae4f84604a2751998dc25a0d1ba278f,
                    vout: 0,
                },
                script_sig: Script(),

failures:
    send::test::official_vectors

test result: FAILED. 33 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
