*** payjoin/src/send/mod.rs:239:21: replace && with || in PsbtContext::check_outputs

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace && with || in PsbtContext::check_outputs
@@ -231,17 +231,17 @@
                 // fee output
                 (
                     Some((original_output_index, original_output)),
                     Some(AdditionalFeeContribution {
                         max_amount: max_fee_contrib,
                         vout: fee_contrib_idx,
                     }),
                 ) if proposed_txout.script_pubkey == original_output.script_pubkey
-                    && *original_output_index == fee_contrib_idx =>
+                    || /* ~ changed by cargo-mutants ~ */ *original_output_index == fee_contrib_idx =>
                 {
                     if proposed_txout.value < original_output.value {
                         contributed_fee = original_output.value - proposed_txout.value;
                         ensure!(contributed_fee <= max_fee_contrib, FeeContributionExceedsMaximum);
                         // The remaining fee checks are done in later in `check_fees`
                     }
                     original_outputs.next();
                 }

*** result: Success
