*** payjoin/src/send/mod.rs:242:65: replace - with + in PsbtContext::check_outputs

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace - with + in PsbtContext::check_outputs
@@ -234,17 +234,17 @@
                     Some(AdditionalFeeContribution {
                         max_amount: max_fee_contrib,
                         vout: fee_contrib_idx,
                     }),
                 ) if proposed_txout.script_pubkey == original_output.script_pubkey
                     && *original_output_index == fee_contrib_idx =>
                 {
                     if proposed_txout.value < original_output.value {
-                        contributed_fee = original_output.value - proposed_txout.value;
+                        contributed_fee = original_output.value + /* ~ changed by cargo-mutants ~ */ proposed_txout.value;
                         ensure!(contributed_fee <= max_fee_contrib, FeeContributionExceedsMaximum);
                         // The remaining fee checks are done in later in `check_fees`
                     }
                     original_outputs.next();
                 }
                 // payee output
                 (Some((_original_output_index, original_output)), _)
                     if original_output.script_pubkey == self.payee =>

---- send::test::official_vectors stdout ----
original: Psbt {
    unsigned_tx: Transaction {
        version: Version(
            2,
        ),
        lock_time: 211 blocks,
        input: [
            TxIn {
                previous_output: OutPoint {
                    txid: 833b085de288cda6ff614c6e8655f61e7ae4f84604a2751998dc25a0d1ba278f,
                    vout: 0,
                },
                script_sig: Script(),

failures:
    send::test::official_vectors

test result: FAILED. 33 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
