*** payjoin/src/send/mod.rs:250:54: replace == with != in PsbtContext::check_outputs

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace == with != in PsbtContext::check_outputs
@@ -242,17 +242,17 @@
                         contributed_fee = original_output.value - proposed_txout.value;
                         ensure!(contributed_fee <= max_fee_contrib, FeeContributionExceedsMaximum);
                         // The remaining fee checks are done in later in `check_fees`
                     }
                     original_outputs.next();
                 }
                 // payee output
                 (Some((_original_output_index, original_output)), _)
-                    if original_output.script_pubkey == self.payee =>
+                    if original_output.script_pubkey != /* ~ changed by cargo-mutants ~ */ self.payee =>
                 {
                     ensure!(
                         !self.disable_output_substitution
                             || (proposed_txout.script_pubkey == original_output.script_pubkey
                                 && proposed_txout.value >= original_output.value),
                         DisallowedOutputSubstitution
                     );
                     original_outputs.next();

*** result: Success
