*** payjoin/src/send/mod.rs:288:33: replace != with == in check_single_payee

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace != with == in check_single_payee
@@ -280,17 +280,17 @@
     psbt: &Psbt,
     script_pubkey: &Script,
     amount: Option<bitcoin::Amount>,
 ) -> Result<(), InternalBuildSenderError> {
     let mut payee_found = false;
     for output in &psbt.unsigned_tx.output {
         if output.script_pubkey == *script_pubkey {
             if let Some(amount) = amount {
-                if output.value != amount {
+                if output.value == /* ~ changed by cargo-mutants ~ */ amount {
                     return Err(InternalBuildSenderError::PayeeValueNotEqual);
                 }
             }
             if payee_found {
                 return Err(InternalBuildSenderError::MultiplePayeeOutputs);
             }
             payee_found = true;
         }

*** result: Success
