*** payjoin/src/send/mod.rs:334:5: replace check_fee_output_amount -> Result<bitcoin::Amount, InternalBuildSenderError> with Ok(Default::default())

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace check_fee_output_amount -> Result<bitcoin::Amount, InternalBuildSenderError> with Ok(Default::default())
@@ -326,25 +326,17 @@
 }
 
 /// Ensure that an additional fee output is sufficient to pay for the specified additional fee
 fn check_fee_output_amount(
     output: &TxOut,
     fee: bitcoin::Amount,
     clamp_fee_contribution: bool,
 ) -> Result<bitcoin::Amount, InternalBuildSenderError> {
-    if output.value < fee {
-        if clamp_fee_contribution {
-            Ok(output.value)
-        } else {
-            Err(InternalBuildSenderError::FeeOutputValueLowerThanFeeContribution)
-        }
-    } else {
-        Ok(fee)
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Find the sender's change output index by eliminating the payee's output as a candidate.
 fn find_change_index(
     psbt: &Psbt,
     payee: &Script,
     fee: bitcoin::Amount,
     clamp_fee_contribution: bool,

*** result: Success
