*** payjoin/src/send/mod.rs:354:64: replace == with != in find_change_index

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace == with != in find_change_index
@@ -346,17 +346,17 @@
 fn find_change_index(
     psbt: &Psbt,
     payee: &Script,
     fee: bitcoin::Amount,
     clamp_fee_contribution: bool,
 ) -> Result<Option<AdditionalFeeContribution>, InternalBuildSenderError> {
     match (psbt.unsigned_tx.output.len(), clamp_fee_contribution) {
         (0, _) => return Err(InternalBuildSenderError::NoOutputs),
-        (1, false) if psbt.unsigned_tx.output[0].script_pubkey == *payee =>
+        (1, false) if psbt.unsigned_tx.output[0].script_pubkey != /* ~ changed by cargo-mutants ~ */ *payee =>
             return Err(InternalBuildSenderError::FeeOutputValueLowerThanFeeContribution),
         (1, true) if psbt.unsigned_tx.output[0].script_pubkey == *payee => return Ok(None),
         (1, _) => return Err(InternalBuildSenderError::MissingPayeeOutput),
         (2, _) => (),
         _ => return Err(InternalBuildSenderError::AmbiguousChangeOutput),
     }
     let (index, output) = psbt
         .unsigned_tx

*** result: Success
