*** payjoin/src/send/mod.rs:389:29: replace == with != in check_change_index

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace == with != in check_change_index
@@ -381,17 +381,17 @@
     index: usize,
     clamp_fee_contribution: bool,
 ) -> Result<AdditionalFeeContribution, InternalBuildSenderError> {
     let output = psbt
         .unsigned_tx
         .output
         .get(index)
         .ok_or(InternalBuildSenderError::ChangeIndexOutOfBounds)?;
-    if output.script_pubkey == *payee {
+    if output.script_pubkey != /* ~ changed by cargo-mutants ~ */ *payee {
         return Err(InternalBuildSenderError::ChangeIndexPointsAtPayee);
     }
     Ok(AdditionalFeeContribution {
         max_amount: check_fee_output_amount(output, fee, clamp_fee_contribution)?,
         vout: index,
     })
 }

*** result: Success
