*** payjoin/src/send/mod.rs:429:21: replace > with == in serialize_url

*** mutation diff:
--- payjoin/src/send/mod.rs
+++ replace > with == in serialize_url
@@ -421,17 +421,17 @@
     if disable_output_substitution {
         url.query_pairs_mut().append_pair("disableoutputsubstitution", "true");
     }
     if let Some(AdditionalFeeContribution { max_amount, vout }) = fee_contribution {
         url.query_pairs_mut()
             .append_pair("additionalfeeoutputindex", &vout.to_string())
             .append_pair("maxadditionalfeecontribution", &max_amount.to_sat().to_string());
     }
-    if min_fee_rate > FeeRate::ZERO {
+    if min_fee_rate == /* ~ changed by cargo-mutants ~ */ FeeRate::ZERO {
         // TODO serialize in rust-bitcoin <https://github.com/rust-bitcoin/rust-bitcoin/pull/1787/files#diff-c2ea40075e93ccd068673873166cfa3312ec7439d6bc5a4cbc03e972c7e045c4>
         let float_fee_rate = min_fee_rate.to_sat_per_kwu() as f32 / 250.0_f32;
         url.query_pairs_mut().append_pair("minfeerate", &float_fee_rate.to_string());
     }
     Ok(url)
 }
 
 #[cfg(test)]

---- send::test::test_disable_output_substitution_query_param stdout ----

thread 'send::test::test_disable_output_substitution_query_param' panicked at payjoin/src/send/mod.rs:511:9:
assertion `left == right` failed
  left: Url { scheme: "http", cannot_be_a_base: false, username: "", password: None, host: Some(Domain("localhost")), port: None, path: "/", query: Some("v=2&disableoutputsubstitution=true&minfeerate=0"), fragment: None }
 right: Url { scheme: "http", cannot_be_a_base: false, username: "", password: None, host: Some(Domain("localhost")), port: None, path: "/", query: Some("v=2&disableoutputsubstitution=true"), fragment: None }

failures:
    send::test::test_disable_output_substitution_query_param

test result: FAILED. 33 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
